package HomeWork4.AppliedProducts;
/*
Список разрешенных продуктов
Класс Пищевая Ценность
Свойства: имя продукта / белки / жиры / углеводы / калории
Минимум 4 конструктора
Реализовать необходимые проверки входящих данных
Создать не менее 4 экземпляров данного класса (объектов)
Класс Мои Продукты
Свойства: разрешенное количество белков / жиров / углеводов / калорий / список разрешенных продуктов (массив)
Реализовать метод, который принимает на вход название продукта и добавляет его в список разрешенных,
если характеристики продукта полностью соответствуют заявленным разрешениям,
в противном случае сообщить, по какой причине продукт не может быть добавлен в список
Реализовать метод, который показывает список разрешенных продуктов
При выполнении задания необходимо обращать внимание на модификаторы доступа и выполнять все необходимые проверки.
 */
public class Application {
    public static void main(String[] args) {

    }
}
